package org.jiira;

public class Launch {
	public static void main(String[] args) {
//		"/a/b", "/a/b/*", "/d/c/*", "/d/c"
		MyInterceptor a = new MyInterceptor();
//		System.out.println(!a.check("/d")?"通过":"未通过"
		
		String url = "　　我不是IT人，至少不是一个真正的IT人。在打工的生涯中，我从一个小职员走到了一个程序员，在创业的生涯中，我从一个人单枪匹马做到了几个人的网络小组。活在这个圈中，每天面对着那些可爱的IT人，我不得不编造各种谎言，不断给他们希望，却让他们不断的在希望中走向失望。我无能为力，无助的看着他们，也无助的看着自己，时间还在静静的流淌，我们也静静的老去，退出这个圈子，是绝大多数人的最终选择。无奈在圈子中滋生着，泛滥着，于是，浮躁诞生了,似乎那是IT人的特征，但那也是他们唯一挣扎的表现。我见过很多老程序员。他们曾经创造了令人骄傲的业绩，那是在当他们年轻的时候。在中国，程序员的大限是28岁，请不要怀疑，他们的职业生命比妓女还要短暂。看看今天的他们吧，挂在脸上的是那无法掩饰的焦虑和孤独寂寞的迷茫。很多老程产生了种种生存的障碍，他们说着刻板的话，似乎是由程序语言结合人类文字诞生的新型语言；他们渴望和别人接触，而他们的孤独令所有人远离；他们经常回忆起当年的辉煌，脸上充满着兴奋的色彩，就象吸了毒的人在巅峰徘徊。当他们回到现实，你却能发现他们脸上那无奈惨白。他们越来越感到压力，他们越来越发现精力不济，他们越来越感到迷茫，不写程序，他们还能做什么？学习的压力、生活的压力、前途渺茫的压力，把他们从阳光灿烂的脸压成了一张张灰色的，扭曲的，无奈的和迷茫的脸。这就是程序员的悲哀。\r\n" + 
				"\r\n" + 
				"　　老程序员面对着两个选择，要么转行，要么退出这个圈子。于是可爱的IT人开始了第一次分流，他们大多处在26-28岁之间。经过放弃的痛苦和不断的努力，他们中的很少的一部分人留了下来，继续耕耘在这片中国IT贫瘠的土地上。能够留下来的是那些语言功能尚未退化的人，他们不但还保留着技术的残迹，同时他们迅速练就了听说读写的能力，于是他们成为了IT公司的中流砥柱，他们通常充当着顾问、经理等重要的职位。他们也分为两种人，一种人继续耕耘在技术的领域中，一种人分流到了纯粹业务的领域中。由于技术的封闭性，导致那些继续从事技术领导的人逐渐产生了更大的压力，他们在技术的漩涡中被更深的卷了进去。而那些从事业务的人，逐渐从技术的漩涡中解脱出来，步入了正常人的生活圈子。从事技术的人，无论他们从事哪种技术，在中国，他们的上限最高也就是32岁。从事业务的人，无论他们从事哪种业务，他们几乎都没有了上限。可以说，选择技术的人，他们是勇敢的，无论是盲目的勇敢还是理性的勇敢，他们都将陷入更深的泥潭，面对他们，我只能敬佩的说，他们才是真正的IT人。\r\n" + 
				"\r\n" + 
				"　　在中国，他们的悲剧是早就注定了的。中国的IT业是在一穷二白的基础上来追赶第一世界的，在这个过程中，国家的投入可谓微不足道。第三世界和第一世界在IT领域的差异是要他们这几代IT人来弥补的，那是他们不得不承受的责任，而他们的付出和国家的进步相比当然更是微不足道。在这8年中，我看到了很多IT人的命运，最好的命运是出国继续搞IT，最差的命运是消失。转了行的人，从此在IT界消失了，几年之后他们几乎不会留下任何痕迹，他们的代码早就过时了，他们的思想早就随着程序的删除而被永远的删除了。没有转行的IT人浮躁着，巨大的压力让他们喘不过气来，跳槽，不断的跳槽，以为跳槽可以改变他们的命运，可跳到了头他们才木然醒悟到，所有的IT企业都是一样的，招他们过来无非就是为了个人的利益和国家的利益继续想办法榨干他们的大脑，他们的命运并没有改变，他们还是这个圈里的人，他们还是无法摆脱这个圈子的悲剧。跳到头的IT人们醒悟到，既然天下的乌鸦一般黑，干脆我们也去做乌鸦吧，反正跑不出这个圈子了，成为乌鸦一定会找到幸福的。于是他们四处寻找着机会，似乎找到一个项目就是由小鸡变成乌鸦的开始。大浪滔沙，多少人成为了乌鸦，又马上的变成了一只没有了毛的鸡，多少人不断的坚持着他们乌鸦的道路，可到头来才知道，其实乌鸦也很无奈，而且乌鸦更没有退路。成为了乌鸦的IT人，突然发现，周围到处都是乌鸦，而头上写着IT字样的那些乌鸦们终日的惶惶不安，他们紧紧盯住地里的几颗烂白菜，一旦发现有那么一个小小的机会可以跻身过去，他们便奋不顾身，饥不择食。 经过了一切的一切，他们终于醒悟到，他们只不过是这个国家的一段程序，不断被执行着，唯一的回报是那些永无止境和不断重复着的0和1，从没有，到获得，到付出，再到什么都没有。执行着，循环着，机械的，挣扎着……";
		System.out.println(url.length());
	}
}
